Revit 2027 API
View.PartsVisibility Property
 The visibility setting for parts in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PartsVisibility PartsVisibility { get; set; }
Public Property PartsVisibility As PartsVisibility
	Get
	Set
public:
property PartsVisibility PartsVisibility {
	PartsVisibility get ();
	void set (PartsVisibility value);
}
member PartsVisibility : PartsVisibility with get, set
Property Value
PartsVisibility
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
View Class
Autodesk.Revit.DB Namespace